# Homebrew Formulas - Non-Admin
# CLI tools and libraries that don't require admin privileges

tap "homebrew/core"
tap "microsoft/mssql-release", "https://github.com/Microsoft/homebrew-mssql-release"
tap "pkryger/emacsmacport-exp"

# Core CLI Tools
brew "awscli"
# brew "bash-language-server"  # Let editors manage language servers
brew "bat"
# brew "black"  # Let projects manage formatters via dev dependencies
brew "broot"
brew "btop"
brew "bzip2"
brew "catch2"
# brew "ccls"  # Let editors manage C/C++ language servers
# brew "clang-format"  # Let projects manage formatters via dev dependencies
brew "cliclick"
brew "cloc"
brew "cmake"
brew "cmake-docs"
brew "cmatrix"
brew "cowsay"
brew "ctags"
brew "curl"
brew "diffutils"
brew "direnv"
brew "doxygen"
brew "dust"
brew "editorconfig"
brew "enchant"
brew "exercism"
brew "eza"
brew "fastfetch"
brew "fd"
brew "fennel"
brew "fortune"
brew "fzf"
brew "gcc"
brew "gflags"
brew "gh"
brew "git"
brew "git-delta"
brew "glow"
brew "glslang"
brew "gnu-sed"
brew "gnu-typist"
brew "gnuplot"
brew "go"
brew "gobject-introspection"
brew "gradle"
brew "graphviz"
brew "grep"
brew "grip"
brew "groff"
brew "guile"
brew "helix"
brew "htop"
brew "hyperfine"
brew "imagemagick"
brew "ipython"
# brew "isort"  # Let projects manage import sorters via dev dependencies
brew "ispell"
brew "isync"
# brew "jdtls"  # Let editors manage Java language servers
brew "jenv"
brew "jpeg"
brew "jq"
brew "just"
brew "keychain"
# brew "kotlin-language-server"  # Let editors manage Kotlin language servers
brew "lazygit"
brew "libiconv"
brew "libvterm"
brew "libxpm"
brew "luarocks"
brew "macvim"
brew "mailutils"
brew "make"
brew "markdown"
brew "mas"
brew "maven"
brew "microsoft/mssql-release/mssql-tools"
brew "microsoft/mssql-release/mssql-tools18"
brew "mono"
brew "msmtp"
brew "mu"
brew "neovide"
brew "nghttp2"
brew "node"
brew "ninja"
brew "nlohmann-json"
brew "oh-my-posh"
brew "onefetch"
brew "openjdk@11"
brew "openjdk@17"
brew "p7zip"
brew "pandoc"
brew "pinentry-mac"
brew "pipenv"
brew "pipx"
brew "pkryger/emacsmacport-exp/emacs-mac-exp@31"
brew "poppler"
brew "protoc-gen-go-grpc"
brew "pstree"
brew "pyenv-virtualenv"
# brew "pyright"  # Let editors manage Python language servers
brew "python@3.10"
brew "python@3.9"
brew "qemu"
brew "qt@5"
brew "rbenv"
brew "rbtools"
brew "ripgrep"
brew "rust"
# brew "rust-analyzer"  # Let editors manage Rust language servers
brew "rustup"
brew "samba"
brew "scc"
brew "sdl2"
# brew "shellcheck"  # Let projects manage linters via dev dependencies
# brew "shfmt"  # Let projects manage formatters via dev dependencies
brew "showkey"
brew "sip"
brew "speedtest-cli"
brew "stow"
# brew "stylua"  # Let projects manage Lua formatters via dev dependencies
brew "subversion"
brew "sword"
brew "thrift"
brew "tldr"
brew "tmux"
brew "topgrade"
brew "trash"
brew "tree"
brew "typespeed"
brew "virtualenv"
brew "vivid"
# brew "vscode-langservers-extracted"  # Let editors manage language servers
brew "wget"
brew "zellij"
brew "zoxide"
brew "zsh"

# Homebrew Casks - Non-Admin
# GUI applications that don't require admin privileges

tap "homebrew/cask"
# tap "homebrew/cask-fonts"  # DEPRECATED - fonts are now in homebrew/cask

# Productivity & Utilities
cask "alacritty"
cask "anki"
cask "beyond-compare"
cask "bing-wallpaper"
cask "browserosaurus"
cask "caffeine"
cask "contexts"
cask "cursor"
cask "cursorcerer"
cask "dbeaver-community"
cask "divvy"
cask "eqmac"
cask "finicky"
cask "firefox"
cask "google-chrome"
cask "google-chrome@beta"
cask "google-drive"
cask "grandperspective"
cask "keycastr"
cask "macdown"
cask "mos"
cask "openmtp"
cask "pgadmin4"
cask "postman"
cask "raycast"
cask "slack"
cask "stats"
cask "vanilla"
cask "vlc"
cask "wezterm"
cask "whatsapp"
cask "zed"
cask "zoom"

# Fonts
cask "font-aporetic"
cask "font-iosevka-nerd-font"
cask "font-meslo-lg-nerd-font"

# Mac App Store Apps
# These use Apple ID authentication, not admin privileges

mas "Windows App", id: 1295203466
# Homebrew Formulas - Requires Admin
# CLI tools that may require admin privileges (system integration, services, etc.)

tap "homebrew/core"

# Containerization & Virtualization (may require system integration)
brew "docker"
brew "docker-compose"
brew "podman"

# Database Services (may require system-level permissions)
brew "postgresql@14"

# Homebrew Casks - Requires Admin
# GUI applications that may require admin privileges (services, system integration, etc.)

tap "homebrew/cask"

# Development Tools with Services
cask "docker"
cask "docker-desktop"
cask "visual-studio-code"    # May require password for launchctl services

# System Tools & Integration
cask "1password"             # System integration, browser extensions
cask "alfred@4"             # System-wide shortcuts, may need accessibility permissions
cask "hammerspoon"          # System automation, accessibility permissions
cask "microsoft-auto-update"
cask "microsoft-word"
cask "p4"                   # Perforce client, system integration
cask "tableau"              # Professional software, licensing integration
cask "xquartz"              # X11 system integration
