tap "homebrew/bundle"
tap "homebrew/core"
tap "universal-ctags/universal-ctags"
brew "gcc"
brew "ruby"
brew "automake"
brew "bash"
brew "bat"
brew "libpng"
brew "glib"
brew "libxau"
brew "pixman"
brew "cmake"
brew "coreutils"
brew "gnutls"
brew "curl"
brew "dust"
brew "editorconfig"
brew "elfutils", link: false
brew "emacs"
brew "fswatch"
brew "fzf"
brew "harfbuzz"
brew "gradle"
brew "htop"
brew "ispell"
brew "jenv"
brew "jq"
brew "keychain"
brew "z3"
brew "llvm"
brew "luajit"
brew "luajit-openresty"
brew "markdown"
brew "neofetch"
brew "neovim"
brew "ninja"
brew "node"
brew "nvm"
brew "openjdk"
brew "pyenv"
brew "pyenv-virtualenv"
brew "ripgrep"
brew "shellcheck"
brew "stow"
brew "swig"
brew "tldr"
brew "tmux"
brew "topgrade"
brew "tree"
brew "unixodbc"
brew "vivid"
brew "zsh"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
