tap "universal-ctags/universal-ctags"

# Build tools
brew "automake"
brew "cmake"
brew "gcc"
brew "llvm"
brew "ninja"
brew "swig"

# Shell & terminal
brew "bash"
brew "bat"
brew "broot"
brew "btop"
brew "direnv"
brew "dust"
brew "eza"
brew "fastfetch"
brew "fzf"
brew "htop"
brew "hyperfine"
brew "pstree"
brew "tldr"
brew "tmux"
brew "tree"
brew "vivid"
brew "zoxide"
brew "zsh"

# Git & dev tools
brew "gh"
brew "git-delta"
brew "jq"
brew "just"
brew "lazygit"
brew "ripgrep"

# Editors
brew "editorconfig"
brew "emacs"  # Homebrew Linux typically provides 30+
brew "neovim"

# Languages & runtimes
brew "jenv"
brew "luajit"
brew "luarocks"
brew "node"
brew "nvm"
brew "openjdk"
brew "pyenv"
brew "pyenv-virtualenv"
brew "ruby"

# Other tools
brew "curl"
brew "fswatch"
brew "gradle"
brew "ispell"
brew "keychain"
brew "markdown"
brew "stow"
brew "unixodbc"

brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
