tap "adoptopenjdk/openjdk"
tap "cartr/qt4"
tap "d12frosted/emacs-plus"
tap "equalsraf/neovim-qt"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "martido/graph"
tap "my/local"
tap "nlohmann/json"
tap "theseal/ssh-askpass"
brew "xz"
brew "openssl@3"
brew "aspell"
brew "autoenv"
brew "automake"
brew "bat"
brew "black", link: false
brew "pcre2"
brew "glib"
brew "catch2"
brew "ccls"
brew "clang-format"
brew "cloc"
brew "cmake"
brew "cmake-docs"
brew "cmatrix"
brew "coreutils"
brew "cowsay"
brew "ctags"
brew "curl"
brew "diffutils"
brew "direnv"
brew "docker", link: false
brew "doxygen"
brew "dust"
brew "editorconfig"
brew "exa"
brew "exercism"
brew "expat"
brew "fd"
brew "fortune"
brew "fzf"
brew "gcc"
brew "gdk-pixbuf"
brew "gflags"
brew "git"
brew "git-delta"
brew "glslang"
brew "unbound"
brew "gnupg"
brew "gpgme"
brew "gnu-sed"
brew "gnu-typist"
brew "harfbuzz"
brew "qt"
brew "gnuplot"
brew "go"
brew "pkg-config"
brew "gobject-introspection"
brew "gradle"
brew "librsvg"
brew "graphviz"
brew "grep"
brew "guile"
brew "htop"
brew "hyperfine"
brew "libheif"
brew "imagemagick"
brew "ipython"
brew "isort", link: false
brew "ispell"
brew "isync"
brew "jenv"
brew "jq"
brew "just"
brew "keychain"
brew "lazygit"
brew "libgccjit"
brew "libiconv"
brew "llvm"
brew "luarocks"
brew "ruby"
brew "macvim"
brew "mailutils"
brew "markdown"
brew "mas"
brew "maven"
brew "node"
brew "mermaid-cli"
brew "mono"
brew "msmtp"
brew "mu"
brew "neofetch"
brew "neovim"
brew "neovide"
brew "nghttp2"
brew "ninja"
brew "nlohmann-json"
brew "openjdk@11"
brew "openjdk@17"
brew "virtualenv", link: false
brew "pipenv", link: false
brew "platypus"
brew "poppler"
brew "postgresql@14"
brew "pstree"
brew "pyenv"
brew "pyenv-virtualenv"
brew "python@3.10"
brew "python@3.9"
brew "qemu"
brew "qt@5"
brew "ruby-build"
brew "rbenv"
brew "rbtools"
brew "ripgrep"
brew "rustup-init"
brew "samba"
brew "scc"
brew "sdl2"
brew "shellcheck"
brew "shfmt"
brew "showkey"
brew "sip"
brew "speedtest-cli"
brew "stow"
brew "subversion"
brew "sword"
brew "tldr"
brew "tmux"
brew "topgrade"
brew "trash"
brew "tree"
brew "typespeed"
brew "unixodbc"
brew "vivid"
brew "vscode-langservers-extracted"
brew "wget"
brew "zellij"
brew "d12frosted/emacs-plus/emacs-plus@29", args: ["with-native-comp"]
brew "equalsraf/neovim-qt/neovim-qt"
cask "adoptopenjdk"
cask "alacritty"
cask "alfred"
cask "alfred4"
cask "amethyst"
cask "anki"
cask "appcleaner"
cask "bing-wallpaper"
cask "caffeine"
cask "cheatsheet"
cask "contexts"
cask "cursorcerer"
cask "dash"
cask "discord"
cask "divvy"
cask "docker"
cask "dteoh-devdocs"
cask "font-alegreya"
cask "font-iosevka-nerd-font"
cask "google-chrome"
cask "google-chrome-beta"
cask "hammerspoon"
cask "iterm2-beta"
cask "jd-gui"
cask "karabiner-elements"
cask "keycastr"
cask "kindle"
cask "macdown"
cask "microsoft-remote-desktop"
cask "mos"
cask "nvidia-geforce-now"
cask "openmtp"
cask "p4"
cask "pgadmin4"
cask "platypus"
cask "powershell"
cask "quip"
cask "shortcutdetective"
cask "slack"
cask "stats"
cask "steam"
cask "vanilla"
cask "vimr"
cask "visual-studio-code"
cask "wezterm"
cask "whatsapp"
cask "xquartz"
mas "Flow", id: 1423210932
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Microsoft Remote Desktop", id: 1295203466
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "The Unarchiver", id: 425424353
mas "Xcode", id: 497799835
mas "Yack!", id: 1525166806
vscode "bodil.file-browser"
vscode "eamodio.gitlens"
vscode "googlecloudtools.cloudcode"
vscode "jacobdufault.fuzzy-search"
vscode "kahole.magit"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "redhat.java"
vscode "tootone.org-mode"
vscode "twxs.cmake"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscodevim.vim"
vscode "VSpaceCode.vspacecode"
vscode "VSpaceCode.whichkey"
