tap "homebrew/bundle"
tap "homebrew/core"
brew "aspell"
brew "black"
brew "curl"
brew "direnv"
brew "dust"
brew "editorconfig"
brew "llvm"
brew "gnuplot"
brew "isort"
brew "jenv"
brew "keychain"
brew "markdown"
brew "neovim"
brew "pipenv"
brew "pyenv"
brew "shellcheck"
brew "stow"
