tap "adoptopenjdk/openjdk"
tap "cartr/qt4"
tap "d12frosted/emacs-plus"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "martido/graph"
brew "aspell"
brew "automake"
brew "bat"
brew "python@3.9"
brew "black"
brew "glib"
brew "pkg-config"
brew "clang-format"
brew "cmake"
brew "coreutils"
brew "ctags"
brew "direnv"
brew "docker", link: false
brew "docker-machine"
brew "dust"
brew "editorconfig"
brew "exercism"
brew "fd"
brew "freetds@0.91", link: true
brew "gdk-pixbuf"
brew "git"
brew "glslang"
brew "gnu-sed"
brew "gobject-introspection"
brew "harfbuzz"
brew "gnuplot"
brew "guile"
brew "nghttp2"
brew "unbound"
brew "openjdk"
brew "gradle"
brew "python@3.8"
brew "librsvg"
brew "graphviz"
brew "htop"
brew "libheif"
brew "imagemagick"
brew "ipython"
brew "ispell"
brew "jenv"
brew "jq"
brew "keychain"
brew "llvm"
brew "markdown"
brew "mas"
brew "mono"
brew "fastfetch"
brew "lua@5.1"
brew "luarocks"
brew "neovim"
brew "ninja"
brew "node"
brew "poppler"
brew "postgresql"
brew "pstree"
brew "pyenv"
brew "pyenv-virtualenv"
brew "ruby-build"
brew "rbenv"
brew "rbtools"
brew "ripgrep"
brew "ruby"
brew "scc"
brew "shellcheck"
brew "speedtest-cli"
brew "stow"
brew "tldr"
brew "tmux"
brew "tree"
brew "unixodbc"
brew "wget"
brew "cartr/qt4/pyqt@4"
brew "d12frosted/emacs-plus/emacs-plus@30", args: ["with-debug", "with-elrumo2-icon", "with-native-comp"]
cask "adoptopenjdk8"
cask "amethyst"
cask "appcleaner"
cask "brave-browser"
cask "caffeine"
cask "cursorcerer"
cask "firefox"
cask "font-iosevka-nerd-font"
cask "gimp"
cask "karabiner-elements"
cask "mos"
cask "stats"
cask "vanilla"
cask "vimr"
cask "virtualbox"
cask "xquartz"
mas "feedly", id: 865500966
mas "GIPHY CAPTURE", id: 668208984
mas "GrandPerspective", id: 1111570163
mas "Kindle", id: 405399194
mas "LinCastor Browser", id: 1037256618
mas "Microsoft Remote Desktop", id: 1295203466
mas "Time Out", id: 402592703
mas "Xcode", id: 497799835
