tap "adoptopenjdk/openjdk"
tap "cartr/qt4"
tap "claui/whence"
tap "d12frosted/emacs-plus"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "martido/graph"
tap "theseal/ssh-askpass"
brew "xz"
brew "aspell"
brew "automake"
brew "bash"
brew "bat"
brew "black"
brew "gcc"
brew "btop"
brew "pcre2"
brew "glib"
brew "clang-format"
brew "cloc"
brew "cmake"
brew "coreutils"
brew "cowsay"
brew "ctags"
brew "diffutils"
brew "direnv"
brew "docker"
brew "doxygen"
brew "dust"
brew "editorconfig"
brew "fd"
brew "fortune"
brew "gdk-pixbuf"
brew "git"
brew "git-delta"
brew "glslang"
brew "gnu-sed"
brew "gnu-typist"
brew "unbound"
brew "gnupg"
brew "harfbuzz"
brew "qt"
brew "gnuplot"
brew "pkg-config"
brew "gobject-introspection"
brew "openjdk"
brew "gradle"
brew "librsvg"
brew "graphviz"
brew "grep"
brew "guile"
brew "htop"
brew "libheif"
brew "imagemagick"
brew "ipython"
brew "ispell"
brew "jenv"
brew "jq"
brew "just"
brew "keychain"
brew "libgccjit"
brew "markdown"
brew "mas"
brew "maven"
brew "mono"
brew "neofetch"
brew "neovim"
brew "nghttp2"
brew "ninja"
brew "node"
brew "openjdk@11"
brew "pipenv"
brew "poppler"
brew "postgresql@14"
brew "pstree"
brew "pyenv"
brew "pyenv-virtualenv"
brew "qt@5"
brew "ruby-build"
brew "rbenv"
brew "rbtools"
brew "ripgrep"
brew "ruby"
brew "rustup-init"
brew "scc"
brew "shellcheck"
brew "showkey"
brew "sip"
brew "speedtest-cli"
brew "stow"
brew "subversion"
brew "sword"
brew "tldr"
brew "tmux"
brew "tree"
brew "typespeed"
brew "unixodbc"
brew "wget"
brew "d12frosted/emacs-plus/emacs-plus@29", args: ["with-native-comp"]
cask "adoptopenjdk"
cask "appcleaner"
cask "caffeine"
cask "cursorcerer"
cask "font-iosevka-nerd-font"
cask "google-chrome"
cask "google-chrome-beta"
cask "iterm2-beta"
cask "karabiner-elements"
cask "macdown"
cask "microsoft-remote-desktop"
cask "mos"
cask "odbc-manager"
cask "p4"
cask "stats"
cask "vanilla"
cask "vimr"
cask "visual-studio-code"
cask "xquartz"
vscode "Meezilla.json"
vscode "ZainChen.json"
