tap "d12frosted/emacs-plus"
tap "daviderestivo/emacs-head"
tap "equalsraf/neovim-qt"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "nlohmann/json"
brew "aspell"
brew "bat"
brew "python@3.9"
brew "black"
brew "catch2"
brew "clang-format"
brew "cloc"
brew "cmake"
brew "coreutils"
brew "ctags"
brew "zstd"
brew "curl"
brew "direnv"
brew "dust"
brew "editorconfig"
brew "exercism"
brew "expat"
brew "fd"
brew "fzf"
brew "gcc"
brew "gflags"
brew "git"
brew "git-delta"
brew "glslang"
brew "gpgme"
brew "harfbuzz"
brew "pango"
brew "gnuplot"
brew "go"
brew "htop"
brew "imagemagick"
brew "isort"
brew "ispell"
brew "isync"
brew "jenv"
brew "jq"
brew "keychain"
brew "libiconv"
brew "librsvg"
brew "llvm"
brew "mailutils"
brew "make"
brew "markdown"
brew "mas"
brew "msmtp"
brew "mu"
brew "neofetch"
brew "neovim"
brew "nlohmann-json"
brew "node"
brew "platypus"
brew "pstree"
brew "pyenv"
brew "pyenv-virtualenv"
brew "qemu"
brew "ruby-build"
brew "rbenv"
brew "ripgrep"
brew "shellcheck"
brew "stow"
brew "sword"
brew "tldr"
brew "tmux"
brew "topgrade"
brew "tree"
brew "vifm"
brew "wget"
brew "d12frosted/emacs-plus/emacs-plus@28", args: ["with-cacodemon-icon", "with-native-comp"], link: false
brew "daviderestivo/emacs-head/emacs-head@28", args: ["with-cocoa", "with-modern-icon-elrumo2"]
brew "equalsraf/neovim-qt/neovim-qt"
brew "koekeishiya/formulae/yabai"
cask "alacritty"
cask "alfred"
cask "amethyst"
cask "appcleaner"
cask "basictex"
cask "blender"
cask "caffeine"
cask "cheatsheet"
cask "contexts"
cask "cursorcerer"
cask "dash"
cask "divvy"
cask "dteoh-devdocs"
cask "font-iosevka-nerd-font"
cask "gimp"
cask "google-chrome-beta"
cask "hammerspoon"
cask "hiddenbar"
cask "iterm2"
cask "karabiner-elements"
cask "keycastr"
cask "kindle"
cask "mos"
cask "openmtp"
cask "platypus"
cask "shortcutdetective"
cask "stats"
cask "xquartz"
mas "Flow", id: 1423210932
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Microsoft Remote Desktop", id: 1295203466
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "The Unarchiver", id: 425424353
mas "Xcode", id: 497799835
mas "Yack!", id: 1525166806
