bierner.markdown-mermaid
bodil.file-browser
docker.docker
jacobdufault.fuzzy-search
kahole.magit
mkhl.direnv
ms-azuretools.vscode-docker
ms-vscode-remote.remote-containers
redhat.java
salesforce.salesforce-internal-dx
tomoki1207.pdf
visualstudioexptteam.intellicode-api-usage-examples
visualstudioexptteam.vscodeintellicode
vscjava.vscode-gradle
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-maven
vscodevim.vim
vspacecode.vspacecode
vspacecode.whichkey
